InformationRegisters/ЛокальноеХранилище.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЛокальноеХранилище</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗашифрованноеЗначение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модифицированность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Секрет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секреты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПраваДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПраваДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокДоступа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СекретСейф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секреты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сейфы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСекретов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСекретов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Локальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Секреты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Секреты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сейф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сейфы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТегиСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСекрета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСекретов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЛокальноеХранилище/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет шифрование заданного текста с использованием указанного открытого ключа.
//
// Параметры:
//   Текст - Строка - исходные данные для шифрования
//   ОткрытыйКлюч - Строка - ключ, используемый для шифрования данных
//
// Возвращаемое значение:
//   Строка - зашифрованные данные в формате Base64
Функция Зашифровать(Текст, ОткрытыйКлюч) Экспорт

#Если ВебКлиент Тогда
	Возврат "";
#Иначе
	
	Если Не ЗначениеЗаполнено(Текст) Или Не ЗначениеЗаполнено(ОткрытыйКлюч) Тогда
		Возврат "";
	КонецЕсли;
	
	ПутьФайла = ПолучитьИмяВременногоФайла();
	
	ЗаписьТекста = Новый ЗаписьТекста(ПутьФайла);
	ЗаписьТекста.Записать(Текст);
	ЗаписьТекста.Закрыть();
	
	//Архив = Новый ЗаписьФайлаАрхива();
	//Архив.Добавить(ПутьФайла);
	//Данные = Архив.ПолучитьДвоичныеДанные(ОткрытыйКлюч, ТипФайлаАрхива.ZIP, "", 
	//	МетодСжатияФайлаАрхива.Сжатие, УровеньСжатияФайлаАрхива.Оптимальный, МетодШифрованияФайлаАрхива.AES256);
	
	Zip = Новый ЗаписьZipФайла();
    Zip.Добавить(ПутьФайла);
    Данные = Zip.ПолучитьДвоичныеДанные(
        ОткрытыйКлюч,,
        МетодСжатияZip.BZIP2,
        УровеньСжатияZip.Оптимальный,
        МетодШифрованияZip.AES256
    );
	
	УдалитьФайлы(ПутьФайла);
	
	Возврат Base64Строка(Данные);

#КонецЕсли

КонецФункции

// Расшифровывает данные, используя указанный открытый ключ.
//
// Параметры:
//   Данные - Строка - Зашифрованные данные в формате Base64
//   ОткрытыйКлюч - Строка - Открытый ключ для расшифровки
//
// Возвращаемое значение:
//   Строка - Расшифрованные данные
Функция Расшифровать(Данные, ОткрытыйКлюч) Экспорт

#Если ВебКлиент Тогда
	Возврат Неопределено;
#Иначе
	
	Если Не ЗначениеЗаполнено(Данные) Или Не ЗначениеЗаполнено(ОткрытыйКлюч) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Поток = Новый ПотокВПамяти();
	ДвоичныеДанные = Base64Значение(Данные);
	ДвоичныеДанные.Записать(Поток);
	
	Каталог = КаталогВременныхФайлов();
	//Архив = Новый ЧтениеФайлаАрхива(Поток, ОткрытыйКлюч, ТипФайлаАрхива.ZIP);
	//Если Архив.Элементы.Количество() = 0 Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	//Попытка
	//	Архив.Извлечь(Архив.Элементы[0], Каталог, РежимВосстановленияПутейФайлаАрхива.НеВосстанавливать);
	//Исключение
	//	Возврат Неопределено;
	//КонецПопытки;
	//ПолноеИмяФайла = Каталог + ПолучитьРазделительПутиСервера() + Архив.Элементы[0].Имя;
	//Архив.Закрыть();
	
	Zip = Новый ЧтениеZipФайла(Поток, ОткрытыйКлюч);
    Если Zip.Элементы.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;
    Файл = Zip.Элементы[0];
	Попытка
    	Zip.Извлечь(Файл, Каталог, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
    Zip.Закрыть();
    ПолноеИмяФайла = Каталог + ПолучитьРазделительПутиСервера() + Файл.Имя;
	
	
	ЧтениеТекста = Новый ЧтениеТекста(ПолноеИмяФайла);
	Результат = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	УдалитьФайлы(ПолноеИмяФайла);
	
	Возврат Результат;
	
#КонецЕсли

КонецФункции

Функция ОбновитьЛокальноеХранилищеСекретов(ОткрытыйКлюч, Секрет = Неопределено) Экспорт
	НаборЗаписей = РегистрыСведений.ЛокальноеХранилище.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	Если ЗначениеЗаполнено(Секрет) Тогда
		НаборЗаписей.Отбор.Секрет.Установить(Секрет);
	Иначе
		ДобавитьЗаписьЛокальногоХранилища(НаборЗаписей, Неопределено, БазовоеСообщениеСекрета(), ОткрытыйКлюч, Ложь);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Секреты.Ссылка КАК Секрет,
		|	Секреты.ТипСекрета = ЗНАЧЕНИЕ(Перечисление.ТипыСекретов.Локальный) КАК Локальный,
		|	ЕСТЬNULL(ЛокальноеХранилище.Модифицированность, ЛОЖЬ) КАК Модифицированность
		|ИЗ
		|	Справочник.Секреты КАК Секреты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПраваДоступа КАК ПраваДоступа
		|		ПО (ПраваДоступа.СекретСейф В (Секреты.Ссылка, Секреты.Сейф))
		|			И (ПраваДоступа.Пользователь = &ТекущийПользователь)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛокальноеХранилище КАК ЛокальноеХранилище
		|		ПО Секреты.Ссылка = ЛокальноеХранилище.Секрет
		|			И (ЛокальноеХранилище.Пользователь = &ТекущийПользователь)
		|ГДЕ
		|	&Секрет В (НЕОПРЕДЕЛЕНО, Секреты.Ссылка)";
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Секрет", Секрет);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Локальный или Выборка.Модифицированность Тогда
			ТекстСекрета = ЛокальноеХранилище.ПолучитьСекрет(Выборка.Секрет, ОткрытыйКлюч);
		Иначе
			ДанныеСекрета = ИнтеграцияOpenBao.ПолучитьСекрет(Выборка.Секрет);
			ТекстСекрета = КоннекторHTTP.ОбъектВJson(ДанныеСекрета);
		КонецЕсли;
		ДобавитьЗаписьЛокальногоХранилища(НаборЗаписей, Выборка.Секрет, ТекстСекрета, ОткрытыйКлюч, Выборка.Модифицированность);
	КонецЦикла;
	НаборЗаписей.Записать();
КонецФункции

Функция МастерПарольУжеУстановлен() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛокальноеХранилище.Пользователь КАК Пользователь,
		|	ЛокальноеХранилище.Секрет КАК Секрет
		|ИЗ
		|	РегистрСведений.ЛокальноеХранилище КАК ЛокальноеХранилище
		|ГДЕ
		|	ЛокальноеХранилище.Пользователь = &Пользователь
		|	И ЛокальноеХранилище.Секрет = ЗНАЧЕНИЕ(Справочник.Секреты.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция ПроверитьМастерПароль(ОткрытыйКлюч) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛокальноеХранилище.ЗашифрованноеЗначение КАК ЗашифрованноеЗначение
		|ИЗ
		|	РегистрСведений.ЛокальноеХранилище КАК ЛокальноеХранилище
		|ГДЕ
		|	ЛокальноеХранилище.Пользователь = &Пользователь
		|	И ЛокальноеХранилище.Секрет = ЗНАЧЕНИЕ(Справочник.Секреты.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ЗаписатьБазовоеСообщениеСекрета(ОткрытыйКлюч);
		Возврат Истина;
	КонецЕсли;
	Расшифровка = Расшифровать(Выборка.ЗашифрованноеЗначение.Получить(), ОткрытыйКлюч);
	Возврат Расшифровка = БазовоеСообщениеСекрета();
КонецФункции

Функция ПолучитьСекрет(Секрет, ОткрытыйКлюч) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛокальноеХранилище.ЗашифрованноеЗначение КАК ЗашифрованноеЗначение
		|ИЗ
		|	РегистрСведений.ЛокальноеХранилище КАК ЛокальноеХранилище
		|ГДЕ
		|	ЛокальноеХранилище.Пользователь = &Пользователь
		|	И ЛокальноеХранилище.Секрет = &Секрет";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Секрет", Секрет);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат НастройкиКонфигурацииПовтИсп.ДанныеНовогоСекретапоУмолчанию();
	КонецЕсли;
	Расшифровка = Расшифровать(Выборка.ЗашифрованноеЗначение.Получить(), ОткрытыйКлюч);
	Если Расшифровка = Неопределено Тогда
		Возврат НастройкиКонфигурацииПовтИсп.ДанныеНовогоСекретаПоУмолчанию();
	КонецЕсли;
	Возврат КоннекторHTTP.JsonВОбъект(Расшифровка);
КонецФункции

Функция ЗаписатьСекрет(Секрет, ДанныеСекрета, ОткрытыйКлюч, Модифицированность = Ложь) Экспорт
	ТекстСекрета = КоннекторHTTP.ОбъектВJson(ДанныеСекрета);
	НаборЗаписей = РегистрыСведений.ЛокальноеХранилище.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Отбор.Секрет.Установить(Секрет);
	ДобавитьЗаписьЛокальногоХранилища(НаборЗаписей, Секрет, ТекстСекрета, ОткрытыйКлюч, Модифицированность);
	НаборЗаписей.Записать();
КонецФункции

Функция ЗаменитьМастерПароль(ОткрытыйКлючСтарый, ОткрытыйКлючНовый) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛокальноеХранилище.Пользователь КАК Пользователь,
		|	ЛокальноеХранилище.Секрет КАК Секрет,
		|	ЛокальноеХранилище.ЗашифрованноеЗначение КАК ЗашифрованноеЗначение,
		|	ЛокальноеХранилище.Модифицированность КАК Модифицированность
		|ИЗ
		|	РегистрСведений.ЛокальноеХранилище КАК ЛокальноеХранилище
		|ГДЕ
		|	ЛокальноеХранилище.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	НаборЗаписей = РегистрыСведений.ЛокальноеХранилище.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСекрета = Расшифровать(Выборка.ЗашифрованноеЗначение.Получить(), ОткрытыйКлючСтарый);
		ДобавитьЗаписьЛокальногоХранилища(НаборЗаписей, Выборка.Секрет, ТекстСекрета, ОткрытыйКлючНовый, Выборка.Модифицированность);
	КонецЦикла;
	НаборЗаписей.Записать();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция БазовоеСообщениеСекрета()
	Возврат "СекретноеМесто2025";
КонецФункции

Процедура ДобавитьЗаписьЛокальногоХранилища(НаборЗаписей, Секрет, ТекстСекрета, ОткрытыйКлюч, Модифицированность)
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	НоваяЗапись.Секрет = Секрет;
	НоваяЗапись.Модифицированность = Модифицированность;
	НоваяЗапись.ЗашифрованноеЗначение = Новый ХранилищеЗначения(Зашифровать(ТекстСекрета, ОткрытыйКлюч));
КонецПроцедуры

Процедура ЗаписатьБазовоеСообщениеСекрета(ОткрытыйКлюч)
	НаборЗаписей = РегистрыСведений.ЛокальноеХранилище.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	ДобавитьЗаписьЛокальногоХранилища(НаборЗаписей, Неопределено, БазовоеСообщениеСекрета(), ОткрытыйКлюч, Ложь);
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецОбласти
